vlm/extension/DataProcessors/бит_КорректировкаСтруктурыВРЦВРесурсныхСпецификациях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_КорректировкаСтруктурыВРЦВРесурсныхСпецификациях</Name>
			<Comment>ЛТ5.36</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

vlm/extension/Catalogs/ТехнологическиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТехнологическиеОперации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Загрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Непрерывная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МожноПропустить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередаточнаяПартия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСледующейОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТехнологическихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяПЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяШтучное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТехнологическийПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеПроцессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяПЗЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контроль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляТехнологическихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантНаладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНаладки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяШтучноеЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МожноПовторить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоэффициентТехнологическогоПроцесса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВспомогательныеРабочиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/extension/DataProcessors/бит_КорректировкаСтруктурыВРЦВРесурсныхСпецификациях/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Асинх Процедура Гоу(Команда)
	ответ = Ждать ВопросАсинх("Вы точно знаете что делаете?", РежимДиалогаВопрос.ДаНет); 
	Если ответ = КодВозвратаДиалога.Да Тогда    
		ЗапуститьОбработкуНаСервере();
	КонецЕсли; 
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Готово");
КонецПроцедуры

&НаСервере
Процедура ЗапуститьОбработкуНаСервере()
	
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(РС) Тогда
		ТекстЗамены = " И РесурсныеСпецификации.Ссылка = &Ссылка ";
		Запрос.УстановитьПараметр("Ссылка", РС);
	Иначе
		ТекстЗамены = "";
	КонецЕсли;
	Запрос.Текст = СтрШаблон("ВЫБРАТЬ
	                      |	РесурсныеСпецификации.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ РС
	                      |ИЗ
	                      |	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	                      |ГДЕ
	                      |	НЕ РесурсныеСпецификации.ПометкаУдаления
	                      |	%1
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЭтапыПроизводства.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ Этапы
	                      |ИЗ
	                      |	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РС КАК РС
	                      |		ПО ЭтапыПроизводства.Владелец = РС.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТехнологическиеОперации.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Этапы КАК Этапы
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	                      |		ПО Этапы.Ссылка = ТехнологическиеОперации.Владелец", ТекстЗамены);
	
	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	ВыборкаТО = Результат[2].Выбрать();
	Пока ВыборкаТО.Следующий() Цикл
		ТО = ВыборкаТО.Ссылка.ПолучитьОбъект();	
		ТО.РабочийЦентр = Неопределено;
		ТО.ОбменДанными.Загрузка = Истина;
		ТО.Записать();
	КонецЦикла;
	
	ВидыПоРодителям = ПолучитьВидыРабочихЦентровПоРодителям();
	
	ВыборкаЭ = Результат[1].Выбрать();
	Пока ВыборкаЭ.Следующий() Цикл
		ЭО = ВыборкаЭ.Ссылка.ПолучитьОбъект();
		ЗаполнитьТЧ(ЭО, ВидыПоРодителям);
		ЭО.ОбменДанными.Загрузка = Истина;
		ЭО.Записать();
	КонецЦикла;
	
КонецПроцедуры          

&НаСервере
Функция ПолучитьВидыРабочихЦентровПоРодителям()
	
	ВидыПоРодителям = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыРабочихЦентров.Ссылка КАК ВидРабочегоЦентра,
	|	ВидыРабочихЦентров.Родитель КАК Родитель
	|ИЗ
	|	Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
	|ГДЕ
	|	НЕ ВидыРабочихЦентров.ЭтоГруппа
	|	И НЕ ВидыРабочихЦентров.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивВидов = ВидыПоРодителям.Получить(Выборка.Родитель);
		
		Если МассивВидов = Неопределено Тогда
			МассивВидов = Новый Массив;
			ВидыПоРодителям.Вставить(Выборка.Родитель, МассивВидов);
		КонецЕсли;
		
		МассивВидов.Добавить(Выборка.ВидРабочегоЦентра);
		
	КонецЦикла;
	
	Возврат ВидыПоРодителям;
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьТЧ(ВРЦОбъект, ВидыПоРодителям) 
	
	ВРЦОбъект.АльтернативныеВидыРабочихЦентров.Очистить();

	Для Каждого СтрокаВида Из ВРЦОбъект.ВидыРабочихЦентров Цикл
		
		ОсновнойВид = СтрокаВида.ВидРабочегоЦентра;
		
		Если НЕ ЗначениеЗаполнено(ОсновнойВид) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивВидов = ВидыПоРодителям.Получить(ОсновнойВид.Родитель);
		
		Если МассивВидов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ВидРабочегоЦентра Из МассивВидов Цикл
			
			Если ВидРабочегоЦентра = ОсновнойВид Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ВРЦОбъект.АльтернативныеВидыРабочихЦентров.Добавить();
			
			// Копируем остальные одинаковые колонки из основной строки
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВида, , "КлючСвязи, ВидРабочегоЦентра");
			
			// Подставляем альтернативный вид
			НоваяСтрока.ВидРабочегоЦентра = ВидРабочегоЦентра;
			НоваяСтрока.КлючСвязиВидыРабочихЦентров = СтрокаВида.КлючСвязи;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
